create_clock -name CLK1_50 -period 20 [get_ports {CLK1_50}]
derive_clock_uncertainty
set_input_delay -clock { CLK1_50 } 1 [get_ports {DRAM_DQ[0] DRAM_DQ[1] DRAM_DQ[2] DRAM_DQ[3] DRAM_DQ[4] DRAM_DQ[5] DRAM_DQ[6] DRAM_DQ[7] DRAM_DQ[8] DRAM_DQ[9] DRAM_DQ[10] DRAM_DQ[11] DRAM_DQ[12] DRAM_DQ[13] DRAM_DQ[14] DRAM_DQ[15] KEY[0] KEY[1] SW[0] SW[1] SW[2] SW[3] SW[4] SW[5] SW[6] SW[7] SW[8] SW[9]}]
set_output_delay -clock { CLK1_50 } 1 [get_ports {DRAM_ADDR[0] DRAM_ADDR[1] DRAM_ADDR[2] DRAM_ADDR[3] DRAM_ADDR[4] DRAM_ADDR[5] DRAM_ADDR[6] DRAM_ADDR[7] DRAM_ADDR[8] DRAM_ADDR[9] DRAM_ADDR[10] DRAM_ADDR[11] DRAM_ADDR[12] DRAM_BA[0] DRAM_BA[1] DRAM_CAS_N DRAM_CKE DRAM_CLK DRAM_CS_N DRAM_LDQM DRAM_RAS_N DRAM_UDQM DRAM_WE_N LED[0] LED[1] LED[2] LED[3] LED[4] LED[5] LED[6] LED[7] LED[8] LED[9] VGA_B[0] VGA_B[1] VGA_B[2] VGA_B[3] VGA_G[0] VGA_G[1] VGA_G[2] VGA_G[3] VGA_HS VGA_R[0] VGA_R[1] VGA_R[2] VGA_R[3] VGA_VS}]
